app/controllers/friends_controller.rb

  def create
    @friend = Friend.new(friend_params)

    respond_to do |format|
      if @friend.save
---
INSERT INTO "friends" ("first_name", "last_name", "email", "phone", "github", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @friend.update(friend_params)
---
UPDATE "friends" SET "github" = ?, "updated_at" = ? WHERE "friends"."id" = ?  [["github", "github.com/YassineOujaa"], ["updated_at", "2022-03-01 14:28:09.407779"], ["id", 4]]